Tekla Open API Reference for Tekla Structures 2025
AutoDirectionTypeAttribute Class
 The AutoDirectionTypeAttribute class is used for storing the auto direction type. Based on the type the system will then calculate the up direction of the connection/detail if the "Auto" up direction is chosen in the dialog. The attribute is initialized from the custom attribute [AutoDirectionType(AutoDirectionTypeEnum.AUTODIR_DETAIL)] in the connection/detail source.
Inheritance Hierarchy
System.Object
 System.Attribute
 Tekla.Structures.Plugins.AutoDirectionTypeAttribute
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AutoDirectionTypeAttribute : Attribute
Public NotInheritable Class AutoDirectionTypeAttribute
	Inherits Attribute
The AutoDirectionTypeAttribute type exposes the following members.
Constructors
Name | Description
AutoDirectionTypeAttribute(Int32)
 The custom attribute [AutoDirectionType()] uses this to store the auto direction type to the system. This is not to be used by itself.
AutoDirectionTypeAttribute(AutoDirectionTypeEnum)
 The custom attribute [AutoDirectionType()] uses this to store the auto direction type to the system. This is not to be used by itself.
Top
Properties
Name | Description
Type
 The custom attribute [AutoDirectionType()] uses this to store the auto direction type to the system. This is not to be used by itself.
Top
See Also
Reference
Tekla.Structures.Plugins Namespace